spec/fixtures/services/ad_group/mutate_add-req.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns="https://adwords.google.com/api/adwords/cm/v200909"
  xmlns:s="https://adwords.google.com/api/adwords/cm/v200909">

  <env:Header>
    <s:RequestHeader env:mustUnderstand="0">
      <authToken>***censured***</authToken>
      <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
      <developerToken>***censured***</developerToken>
      <clientEmail>***censured***</clientEmail>
    </s:RequestHeader>
  </env:Header>

  <env:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/v200909">
      <operations xsi:type="AdGroupOperation">
        <operator>ADD</operator>
        <operand>

          <campaignId>1000</campaignId>
          <name>sem4r library</name>
          <status>ENABLED</status>

          <bids xsi:type='ManualCPCAdGroupBids'>
            <AdGroupBids.Type>ManualCPCAdGroupBids</AdGroupBids.Type>

            <keywordMaxCpc>
              <amount>
                <ComparableValue.Type>Money</ComparableValue.Type>
                <microAmount>20000000</microAmount>
              </amount>
            </keywordMaxCpc>

            <siteMaxCpc>
              <amount>
                <ComparableValue.Type>Money</ComparableValue.Type>
                <microAmount>30000000</microAmount>
              </amount>
            </siteMaxCpc>

          </bids>

        </operand>
      </operations>
    </mutate>
  </env:Body>
</env:Envelope>

